InformationRegisters/ИзученныеЭлементыЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИзученныеЭлементыЭлектронныхКурсов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Изучено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяИзученияВСекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Контекст</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтекстЭлектронногоОбучения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Учащийся</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчащийсяЭлектронногоОбучения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйКурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоТест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАктивности</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИзучениеЭлектронногоКурса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзучениеЭлектронногоКурса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлементСодержания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СодержаниеЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИзученныеЭлементыЭлектронныхКурсов/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает все завершенные попытки тестов
//
Функция ПройденныеТесты(Учащийся, Контекст) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзученныеЭлементыЭлектронныхКурсов.Период КАК Дата,
		|	ИзученныеЭлементыЭлектронныхКурсов.Результат,
		|	ИзученныеЭлементыЭлектронныхКурсов.ВыставляетсяОценка,
		|	ИзученныеЭлементыЭлектронныхКурсов.ДатаНачала,
		|	ИзученныеЭлементыЭлектронныхКурсов.ДатаОкончания,
		|	ИзученныеЭлементыЭлектронныхКурсов.Регистратор КАК СессияВыполненияТеста,
		|	ИзученныеЭлементыЭлектронныхКурсов.ЭлементСодержания,
		|	ИзученныеЭлементыЭлектронныхКурсов.ЭлементСодержания.Наименование КАК НаименованиеЭлементаСодержания,
		|	ИзученныеЭлементыЭлектронныхКурсов.ЭлектронныйКурс,
		|	ИзученныеЭлементыЭлектронныхКурсов.ЭлектронныйКурс.Наименование КАК НаименованиеЭлектронногоРесурса
		|ИЗ
		|	РегистрСведений.ИзученныеЭлементыЭлектронныхКурсов КАК ИзученныеЭлементыЭлектронныхКурсов
		|ГДЕ
		|	ИзученныеЭлементыЭлектронныхКурсов.Учащийся = &Учащийся
		|	И ИзученныеЭлементыЭлектронныхКурсов.Контекст = &Контекст
		|	И ИзученныеЭлементыЭлектронныхКурсов.ЭтоТест = ИСТИНА
		|	И ИзученныеЭлементыЭлектронныхКурсов.Завершено = ИСТИНА";
	
	Запрос.УстановитьПараметр("Учащийся", Учащийся);
	Запрос.УстановитьПараметр("Контекст", Контекст);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

#КонецОбласти

#КонецЕсли
